README.md
```mermaid
classDiagram
class ML_TriesWithFrequencies_PathsGatherer {
  +$!ulp
  +@!tracedPaths
  +BUILDALL()
  +new()
  +trace()
  +tracedPaths()
  +trie-trace()
  +ulp()
}


class TRIEROOT {
  <<constant>>
}
TRIEROOT --|> Stringy


class TRIEVALUE {
  <<constant>>
}
TRIEVALUE --|> Stringy


class ML_TriesWithFrequencies_ChildRandomChooser {
  +$!ulp
  +$!weighted
  +@!tracedPaths
  +BUILDALL()
  +new()
  +trace()
  +tracedPaths()
  +trie-trace()
  +ulp()
  +weighted()
}


class ML_TriesWithFrequencies_Trieish {
  <<role>>
  +$!key
  +$!value
  +%!children
  +JSON()
  +Str()
  +WL()
  +XML()
  +clone()
  +getChildren()
  +getKey()
  +getValue()
  +hash()
  +setChildren()
  +setKey()
  +setValue()
  +to-map-format()
  +trieRootLabel()
  +trieValueLabel()
}


class ML_TriesWithFrequencies_ParetoBasedRemover {
  +$!pareto-fraction
  +$!postfix
  +$!remove-bottom
  +BUILDALL()
  +new()
  +pareto-fraction()
  +postfix()
  +remove()
  +remove-bottom()
  +trie-map()
  +trie-pareto-remove()
}
ML_TriesWithFrequencies_ParetoBasedRemover --|> ML_TriesWithFrequencies_TrieTraverse


class ML_TriesWithFrequencies_ThresholdBasedRemover {
  +$!below-threshold
  +$!postfix
  +$!threshold
  +BUILDALL()
  +below-threshold()
  +new()
  +postfix()
  +remove()
  +threshold()
  +trie-map()
  +trie-threshold-remove()
}
ML_TriesWithFrequencies_ThresholdBasedRemover --|> ML_TriesWithFrequencies_TrieTraverse


class ML_TriesWithFrequencies_RegexBasedRemover {
  +$!invert
  +$!key-pattern
  +$!postfix
  +BUILDALL()
  +invert()
  +key-pattern()
  +new()
  +postfix()
  +remove()
  +trie-map()
  +trie-regex-remove()
}
ML_TriesWithFrequencies_RegexBasedRemover --|> ML_TriesWithFrequencies_TrieTraverse


class ML_TriesWithFrequencies_TrieTraverse {
  <<role>>
}


class ML_TriesWithFrequencies_Trie {
  +$!key
  +$!value
  +%!children
  +BUILDALL()
  +JSON()
  +Str()
  +WL()
  +XML()
  +children()
  +classify()
  +clone()
  +contains()
  +create()
  +create-by-split()
  +echo()
  +echo-function()
  +form()
  +from-json-map-format()
  +from-map-format()
  +getChildren()
  +getKey()
  +getValue()
  +gist()
  +has-complete-match()
  +hash()
  +insert()
  +is-key()
  +key()
  +leaf-probabilities()
  +leafQ()
  +make()
  +merge()
  +new()
  +node-counts()
  +node-probabilities()
  +position()
  +random-choice()
  +remove-by-pareto-fraction()
  +remove-by-regex()
  +remove-by-threshold()
  +retrieve()
  +root-to-leaf-paths()
  +select-by-pareto-fraction()
  +select-by-regex()
  +select-by-threshold()
  +setChildren()
  +setKey()
  +setValue()
  +shrink()
  +to-map-format()
  +trieRootLabel()
  +trieValueLabel()
  +value()
  +words()
  +words-with-probabilities()
}
ML_TriesWithFrequencies_Trie --|> ML_TriesWithFrequencies_Trieish


class ML_TriesWithFrequencies_LeafProbabilitiesGatherer {
  +$!counts-trie
  +$!ulp
  +BUILDALL()
  +counts-trie()
  +new()
  +trace()
  +trie-trace()
  +ulp()
}
```
